// localized port names

"ether"                   = "อีเธอร์เน็ต";
"multiether"              = "อีเธอร์เน็ต %@";
"pci-ether"               = "สล็อตอีเธอร์เน็ตแบบ PCI %@";
"pci-multiether"          = "สล็อตอีเธอร์เน็ตแบบ PCI %@, พอร์ต %@";
"thunderbolt-ether"       = "ช่องเสียบแบบอีเธอร์เน็ตสำหรับ Thunderbolt %@";
"thunderbolt-multiether"  = "ช่องเสียบแบบอีเธอร์เน็ตสำหรับ Thunderbolt %@, พอร์ต %@";
"usb-ether"               = "อีเธอร์เน็ตแบบ USB (%@)";
"generic-ether"           = "อะแด็ปเตอร์สำหรับอีเธอร์เน็ต (%@)";

"airport"                 = "Wi-Fi";
"generic-wireless"        = "อะแดปเตอร์เครือข่ายไร้สาย (%@)";

"firewire"                = "FireWire";
"pci-firewire"            = "สล็อต PCI FireWire %@";
"pci-multifirewire"       = "สล็อต PCI FireWire %@, พอร์ต %@";
"thunderbolt-firewire"    = "ช่องเสียบแบบ FireWire สำหรับ Thunderbolt %@";
"thunderbolt-multifirewire" = "ช่องเสียบแบบ FireWire สำหรับ Thunderbolt %@, พอร์ต %@";
"generic-firewire"        = "อะแดปเตอร์ FireWire (%@)";

"bluetooth"               = "บลูทูธ DUN";
"bluetooth-modem"         = "อะแด็ปเตอร์สำหรับโมเด็มที่มี USB แบบบลูทูธ";
"bluetooth-modem-port"    = "พอร์ตของโมเด็มแบบบลูทูธ";
"generic-bluetooth-modem" = "โมเด็มแบบบลูทูธ (%@)";

"bluetooth-pan-gn"        = "บลูทูธ PAN";
"bluetooth-pan-nap"       = "บลูทูธ PAN-NAP";
"bluetooth-pan-u"         = "บลูทูธ P2P";

"irda"                    = "IrDA";
"irda-ircomm"             = "อะแด็ปเตอร์สำหรับโมเด็มที่มี USB แบบ IrDA";
"irda-ircomm-port"        = "พอร์ตโมเด็ม IrDA";

"loopback"                = "แบบวนกลับ";

"modem"                   = "โมเด็มภายใน";

"modem-port"              = "พอร์ตโมเด็ม";
"modem-printer-port"      = "พอร์ตของโมเด็มหรือเครื่องพิมพ์";

"printer-port"            = "พอร์ตเครื่องพิมพ์";
"serial-port"             = "พอร์ตอนุกรม";

"usbmodem"                = "โมเด็ม USB"; 
"generic-usbmodem"        = "โมเด็ม USB (%@)"; 

"wwan"                    = "WWAN"; 

"bond"                    = "อีเธอร์เน็ตบอนด์ (%@)";

"bridge"                  = "บริดจ์ (%@)";

"vlan"                    = "VLAN (%@)";

"ipv4"                    = "IPv4";

"l2tp"                    = "L2TP";

"pptp"                    = "PPTP";

"6to4"                    = "6to4";

"ipsec"                   = "IPSec";

"vpn"                     = "VPN (%@)";

// port names (from drivers) that would be good to localize

"AppleTV"                 = "พอร์ต USB สำหรับ Apple TV";

"Display Ethernet"        = "อีเธอร์เน็ตสำหรับจอภาพ";
"Display FireWire"        = "FireWire สำหรับจอภาพ";

"External Modem"          = "โมเด็มภายนอก";

"iPad"                    = "พอร์ต USB สำหรับ iPad";

"iPhone"                  = "iPhone USB";

"iPod"                    = "พอร์ต USB สำหรับ iPod";

"USB Ethernet"            = "อีเธอร์เน็ตแบบ USB";
"USB Gigabit Ethernet"    = "อีเธอร์เน็ตกิกะบิตแบบ USB";

// older ("Built-in", HI changed) localizations

"X-airport"               = "AirPort";
"X-ether"                 = "อีเธอร์เน็ตในตัวเครื่อง";
"X-multiether"            = "อีเธอร์เน็ต %@ ในตัวเครื่อง";
"X-firewire"              = "FireWire ในตัวเครื่อง";
"X-bluetooth"             = "บลูทูธ";
"X-iPhone"                = "iPhone";
